In [127]:
import pandas as pd
import numpy as np
import datetime as dt
import matplotlib.pyplot as plt
import seaborn as sns

In [151]:
dfq1 = pd.read_csv(r'C:\Users\William\Desktop\RTX_LD\RTX_2019Q1.csv')
dfq1 = dfq1[dfq1.region != 'VISAYAS']
dfq1

              date  hour report region type participant     resource    mw
0       2019-01-01     1    RTX  LUZON   LD     WESMTMP  1ANGAT_T5L1   0.0
1       2019-01-01     1    RTX  LUZON   LD        WESM  1BALNEO_L01  50.4
2       2019-01-01     1    RTX  LUZON   LD      LUELCO  1BAUAN_T1L2   0.0
3       2019-01-01     1    RTX  LUZON   LD        WESM  1BINGA_T1L1   0.0
4       2019-01-01     1    RTX  LUZON   LD        WESM  1BOTOL_T1L2  13.8
...            ...   ...    ...    ...  ...         ...          ...   ...
797026  2019-04-01    24    RTX  LUZON   LD        WESM  3CALIR_TAL1   6.7
797027  2019-04-01    24    RTX  LUZON   LD        WESM  3CALI_FLECO  14.3
797028  2019-04-01    24    RTX  LUZON   LD       PSALM     3KAL_P03   0.0
797029  2019-04-01    24    RTX  LUZON   LD        WESM    3MKBNB_SS   4.5
797030  2019-04-01    24    RTX  LUZON   LD        WESM    3MKBNE_SS   1.0

[562899 rows x 8 columns]

In [152]:
dfq2 = pd.read_csv(r'C:\Users\William\Desktop\RTX_LD\RTX_2019Q2.csv')
dfq2 = dfq2[dfq2.region != 'VISAYAS']
dfq2 = dfq2.drop('price',axis = 1)
dfq2

              date  hour report region type participant     resource     mw
0       2019-04-01     1    RTX  LUZON   LD        WESM    1BCNOT_SS    0.0
1       2019-04-01     1    RTX  LUZON   LD        WESM   1BTPP_T3L1    0.0
2       2019-04-01     1    RTX  LUZON   LD        WESM   1BTPP_T3L2   17.8
3       2019-04-01     1    RTX  LUZON   LD     WESMTMP  1CBNTU_T1L1   39.0
4       2019-04-01     1    RTX  LUZON   LD     WESMTMP  1CURIM_T1L2    4.2
...            ...   ...    ...    ...  ...         ...          ...    ...
797000  2019-06-30    24    RTX  LUZON   LD        WESM    3MKBNB_SS    4.4
797001  2019-06-30    24    RTX  LUZON   LD        WESM    3MKBND_SS    1.0
797002  2019-06-30    24    RTX  LUZON   LD        WESM    3ORMAT_SS    0.0
797003  2019-06-30    24    RTX  LUZON   LD        WESM    3STAR_SS2    0.0
797004  2019-06-30    24    RTX  LUZON   LD     MERALCO  3STROS_T1L1  277.0

[563741 rows x 8 columns]

In [153]:
dfq3 = pd.read_csv(r'C:\Users\William\Desktop\RTX_LD\RTX_2019Q3.csv')
dfq3 = dfq3[dfq3.region != 'VISAYAS']
dfq3 = dfq3.drop('price',axis = 1)
dfq3

              date  hour report region type participant     resource    mw
0       2019-07-01     1    RTX  LUZON   LD     WESMTMP     1AEC_L01  38.5
1       2019-07-01     1    RTX  LUZON   LD        WESM    1AMBUK_SS   0.0
2       2019-07-01     1    RTX  LUZON   LD       LUECO  1BAUAN_T1L1  21.8
3       2019-07-01     1    RTX  LUZON   LD        WESM     1BPPC_SS   0.0
4       2019-07-01     1    RTX  LUZON   LD        WESM    1CBNTU_SS   0.0
...            ...   ...    ...    ...  ...         ...          ...   ...
812401  2019-09-30    24    RTX  LUZON   LD        WESM    3MKBNB_SS   4.6
812402  2019-09-30    24    RTX  LUZON   LD        WESM    3MKBNE_SS   1.0
812403  2019-09-30    24    RTX  LUZON   LD        WESM   3PGBIL_SS2  10.7
812404  2019-09-30    24    RTX  LUZON   LD        WESM   3QPPL_T5L1   0.0
812405  2019-09-30    24    RTX  LUZON   LD        WESM    3STAR_SS4   0.0

[573134 rows x 8 columns]

In [154]:
dfq4 = pd.read_csv(r'C:\Users\William\Desktop\RTX_LD\RTX_2019Q4.csv')
dfq4 = dfq4[dfq4.region != 'VISAYAS']
dfq4 = dfq4.drop('price',axis = 1)
dfq4

              date  hour report region type participant     resource    mw
0       2019-10-01     1    RTX  LUZON   LD       LUECO  1BAUAN_T1L1  20.8
1       2019-10-01     1    RTX  LUZON   LD      LUELCO  1BAUAN_T1L2   0.0
2       2019-10-01     1    RTX  LUZON   LD   HOLCIMBAC  1BAUAN_T2L2  17.7
3       2019-10-01     1    RTX  LUZON   LD   HOLCIMBAC  1BCNOT_T1L1  10.6
4       2019-10-01     1    RTX  LUZON   LD        WESM  1BYOMB_T1L1   7.9
...            ...   ...    ...    ...  ...         ...          ...   ...
809184  2019-12-31    24    RTX  LUZON   LD     WESMTMP  3MLAYA_T2L2  44.6
809185  2019-12-31    24    RTX  LUZON   LD        WESM  3NAG_CSRC2B   9.6
809186  2019-12-31    24    RTX  LUZON   LD        WESM    3STAR_SS1   0.0
809187  2019-12-31    24    RTX  LUZON   LD        WESM    3STAR_SS4   0.0
809188  2019-12-31    24    RTX  LUZON   LD        WESM  3TAYAB_T1L2  15.8

[570854 rows x 8 columns]

In [162]:
#dfq1.to_csv(r'C:\Users\William\Desktop\RTX_LD\Test\q1.csv',index=False)

In [163]:
#dfq2.to_csv(r'C:\Users\William\Desktop\RTX_LD\Test\q2.csv',index=False)

In [164]:
#dfq3.to_csv(r'C:\Users\William\Desktop\RTX_LD\Test\q3.csv',index=False)

In [165]:
#dfq4.to_csv(r'C:\Users\William\Desktop\RTX_LD\Test\q4.csv',index=False)

In [186]:
dfq1 = pd.read_csv(r'C:\Users\William\Desktop\RTX_LD\Test\q1.csv')
dfq1

             date  hour report region type participant     resource    mw
0        1/1/2019     1    RTX  LUZON   LD     WESMTMP  1ANGAT_T5L1   0.0
1        1/1/2019     1    RTX  LUZON   LD        WESM  1BALNEO_L01  50.4
2        1/1/2019     1    RTX  LUZON   LD      LUELCO  1BAUAN_T1L2   0.0
3        1/1/2019     1    RTX  LUZON   LD        WESM  1BINGA_T1L1   0.0
4        1/1/2019     1    RTX  LUZON   LD        WESM  1BOTOL_T1L2  13.8
...           ...   ...    ...    ...  ...         ...          ...   ...
556702  3/31/2019    24    RTX  LUZON   LD        WESM    3QPPL_SU1   0.0
556703  3/31/2019    24    RTX  LUZON   LD        WESM    3QPPL_SU2   0.0
556704  3/31/2019    24    RTX  LUZON   LD        WESM    3STAR_SS2   0.0
556705  3/31/2019    24    RTX  LUZON   LD        WESM    3TAYAB_SS   0.0
556706  3/31/2019    24    RTX  LUZON   LD        WESM    3TIWIC_SS   2.5

[556707 rows x 8 columns]

In [187]:
dfq2 = pd.read_csv(r'C:\Users\William\Desktop\RTX_LD\Test\q2.csv')
dfq2

              date  hour report region type participant     resource     mw
0       2019-04-01     1    RTX  LUZON   LD        WESM    1BCNOT_SS    0.0
1       2019-04-01     1    RTX  LUZON   LD        WESM   1BTPP_T3L1    0.0
2       2019-04-01     1    RTX  LUZON   LD        WESM   1BTPP_T3L2   17.8
3       2019-04-01     1    RTX  LUZON   LD     WESMTMP  1CBNTU_T1L1   39.0
4       2019-04-01     1    RTX  LUZON   LD     WESMTMP  1CURIM_T1L2    4.2
...            ...   ...    ...    ...  ...         ...          ...    ...
563736  2019-06-30    24    RTX  LUZON   LD        WESM    3MKBNB_SS    4.4
563737  2019-06-30    24    RTX  LUZON   LD        WESM    3MKBND_SS    1.0
563738  2019-06-30    24    RTX  LUZON   LD        WESM    3ORMAT_SS    0.0
563739  2019-06-30    24    RTX  LUZON   LD        WESM    3STAR_SS2    0.0
563740  2019-06-30    24    RTX  LUZON   LD     MERALCO  3STROS_T1L1  277.0

[563741 rows x 8 columns]

In [188]:
dfq3 = pd.read_csv(r'C:\Users\William\Desktop\RTX_LD\Test\q3.csv')
dfq3

              date  hour report region type participant     resource    mw
0       2019-07-01     1    RTX  LUZON   LD     WESMTMP     1AEC_L01  38.5
1       2019-07-01     1    RTX  LUZON   LD        WESM    1AMBUK_SS   0.0
2       2019-07-01     1    RTX  LUZON   LD       LUECO  1BAUAN_T1L1  21.8
3       2019-07-01     1    RTX  LUZON   LD        WESM     1BPPC_SS   0.0
4       2019-07-01     1    RTX  LUZON   LD        WESM    1CBNTU_SS   0.0
...            ...   ...    ...    ...  ...         ...          ...   ...
573129  2019-09-30    24    RTX  LUZON   LD        WESM    3MKBNB_SS   4.6
573130  2019-09-30    24    RTX  LUZON   LD        WESM    3MKBNE_SS   1.0
573131  2019-09-30    24    RTX  LUZON   LD        WESM   3PGBIL_SS2  10.7
573132  2019-09-30    24    RTX  LUZON   LD        WESM   3QPPL_T5L1   0.0
573133  2019-09-30    24    RTX  LUZON   LD        WESM    3STAR_SS4   0.0

[573134 rows x 8 columns]

In [189]:
dfq4 = pd.read_csv(r'C:\Users\William\Desktop\RTX_LD\Test\q4.csv')
dfq4

              date  hour report region type participant     resource    mw
0       2019-10-01     1    RTX  LUZON   LD       LUECO  1BAUAN_T1L1  20.8
1       2019-10-01     1    RTX  LUZON   LD      LUELCO  1BAUAN_T1L2   0.0
2       2019-10-01     1    RTX  LUZON   LD   HOLCIMBAC  1BAUAN_T2L2  17.7
3       2019-10-01     1    RTX  LUZON   LD   HOLCIMBAC  1BCNOT_T1L1  10.6
4       2019-10-01     1    RTX  LUZON   LD        WESM  1BYOMB_T1L1   7.9
...            ...   ...    ...    ...  ...         ...          ...   ...
570849  2019-12-31    24    RTX  LUZON   LD     WESMTMP  3MLAYA_T2L2  44.6
570850  2019-12-31    24    RTX  LUZON   LD        WESM  3NAG_CSRC2B   9.6
570851  2019-12-31    24    RTX  LUZON   LD        WESM    3STAR_SS1   0.0
570852  2019-12-31    24    RTX  LUZON   LD        WESM    3STAR_SS4   0.0
570853  2019-12-31    24    RTX  LUZON   LD        WESM  3TAYAB_T1L2  15.8

[570854 rows x 8 columns]

In [166]:
#Test

In [190]:
dfs = [dfq1, dfq2, dfq3, dfq4]

In [193]:
combineddf = pd.concat(dfs,ignore_index=True)

In [194]:
combineddf

               date  hour report region type participant     resource    mw
0          1/1/2019     1    RTX  LUZON   LD     WESMTMP  1ANGAT_T5L1   0.0
1          1/1/2019     1    RTX  LUZON   LD        WESM  1BALNEO_L01  50.4
2          1/1/2019     1    RTX  LUZON   LD      LUELCO  1BAUAN_T1L2   0.0
3          1/1/2019     1    RTX  LUZON   LD        WESM  1BINGA_T1L1   0.0
4          1/1/2019     1    RTX  LUZON   LD        WESM  1BOTOL_T1L2  13.8
...             ...   ...    ...    ...  ...         ...          ...   ...
2264431  2019-12-31    24    RTX  LUZON   LD     WESMTMP  3MLAYA_T2L2  44.6
2264432  2019-12-31    24    RTX  LUZON   LD        WESM  3NAG_CSRC2B   9.6
2264433  2019-12-31    24    RTX  LUZON   LD        WESM    3STAR_SS1   0.0
2264434  2019-12-31    24    RTX  LUZON   LD        WESM    3STAR_SS4   0.0
2264435  2019-12-31    24    RTX  LUZON   LD        WESM  3TAYAB_T1L2  15.8

[2264436 rows x 8 columns]

In [197]:
combineddf.to_csv(r'C:\Users\William\Desktop\RTX_LD\Test\combineddf.csv',index=False)